{
  "directed": true,
  "multigraph": false,
  "graph": {
    "node_default": {},
    "edge_default": {}
  },
  "nodes": [
    {
      "name": "Subclass",
      "description": "A subclass is a class derived from the superclass. It inherits the properties of the superclass and also contains attributes of its own.",
      "id": "54"
    },
    {
      "name": "Enhanced Entity-Relationship",
      "description": "Enhanced entity-relationship diagrams are advanced database diagrams very similar to regular ER diagrams which represent requirements and complexities of complex databases.  It is a diagrammatic technique for displaying the Sub Class and Super Class; Specialization and Generalization; Union or Category; Aggregation. ",
      "id": "53"
    },
    {
      "name": "Data Model",
      "description": "Data Models are fundamental entities to introduce abstraction in a DBMS. Data models define how data is connected to each other and how they are processed and stored inside the system.",
      "id": "56"
    },
    {
      "name": "Entity",
      "description": "An entity is a real-world thing that can be distinctly identified as a person, place, or concept. It is an object which is distinguishable from others.",
      "id": "48"
    },
    {
      "name": "Many-To-Many",
      "description": " a many-to-many relationship where many occurrences in an entity relate to many occurrences in another entity.",
      "id": "59"
    },
    {
      "name": "Cardinality ratios",
      "description": "Specifies the maximum number of relationships that an entity can participate in.",
      "id": "57"
    },
    {
      "name": "Two-Phase Locking (2PL) Protocol",
      "description": "Two-Phase Locking Protocol is also known as 2PL protocol is a method of concurrency control in DBMS that ensures serializability by applying a lock to the transaction data which blocks other transactions to access the same data simultaneously. Two-Phase Locking protocol helps to eliminate the concurrency problem in DBMS.",
      "id": "96"
    },
    {
      "name": "Locking",
      "description": "Locking protocols are used in database management systems as a means of concurrency control. Multiple transactions may request a lock on a data item simultaneously.",
      "id": "94"
    },
    {
      "name": "Domain",
      "description": "Domains are the sets of all possible values for attributes.",
      "id": "15"
    },
    {
      "name": "Relational data model",
      "description": "The relational model represents the database as a collection of relations.",
      "id": "14"
    },
    {
      "name": "ALTER TABLE",
      "description": "ALTER TABLE is used to add, delete/drop or modify columns in the existing table. It is also used to add and drop various constraints on the existing table.",
      "id": "26"
    },
    {
      "name": "DDL",
      "description": "A data definition language (DDL) is a computer language used to create and modify the structure of database objects in a database. These database objects include views, schemas, tables, indexes, etc.",
      "id": "22"
    },
    {
      "name": "Authentication",
      "description": "Authentication is the process of confirming that a user logs in only in accordance with the rights to perform the activities he is authorized to perform. User authentication can be performed at the operating system level or database level itself.",
      "id": "89"
    },
    {
      "name": "Access Control",
      "description": "Access control is done by creating user accounts and to control login process by the DBMS. So, that database access of sensitive data is possible only to those people (database users) who are allowed to access such data and to restrict access to unauthorized persons. ",
      "id": "81"
    },
    {
      "name": "Schema",
      "description": "A relation schema has a relation name and a list of attributes.",
      "id": "20"
    },
    {
      "name": "EXCEPT",
      "description": "The SQL EXCEPT clause/operator is used to combine two SELECT statements and returns rows from the first SELECT statement that are not returned by the second SELECT statement. This means EXCEPT returns only rows, which are not available in the second SELECT statement",
      "id": "40"
    },
    {
      "name": "Query",
      "description": "A query is a request for data or information from a database table or combination of tables.",
      "id": "32"
    },
    {
      "name": "Functional dependencies",
      "description": "Functional Dependency (FD) is a constraint that determines the relation of one attribute to another attribute in a Database Management System (DBMS).",
      "id": "64"
    },
    {
      "name": "Implied",
      "description": "To design a good database, we need to consider all possible FDs.",
      "id": "67"
    },
    {
      "name": "Equivalent",
      "description": "Two or more than two sets of functional dependencies are called equivalence if the right-hand side of one set of functional dependency can be determined using the second FD set, similarly, the right-hand side of the second FD set can be determined using the first FD set.",
      "id": "68"
    },
    {
      "name": "Minimal Cover",
      "description": "A minimal cover of a set of FDs F is a minimal set of functional dependencies that is equivalent to F.",
      "id": "69"
    },
    {
      "name": "The Unrepeatable Read Problem",
      "description": "The unrepeatable problem occurs when two or more read operations of the same transaction read different values of the same variable.",
      "id": "99"
    },
    {
      "name": "Concurrent Transactions",
      "description": "Concurrent transaction or execution includes multiple transactions which are executed concurrently or simultaneously in the system.",
      "id": "95"
    },
    {
      "name": "Natural Join",
      "description": "A natural join retains all the data of the two tables for only the matched rows, without duplication.",
      "id": "42"
    },
    {
      "name": "Join",
      "description": "When we want to retrieve data from more than one relation, we often need to use join operations.",
      "id": "33"
    },
    {
      "name": "Read Committed",
      "description": "Read Committed is One transaction only sees committed changes by other\ntransactions.",
      "id": "102"
    },
    {
      "name": "Isolation",
      "description": "In database systems, isolation determines how transaction integrity is visible to other users and systems.",
      "id": "93"
    },
    {
      "name": "Transactions",
      "description": "A transaction is a sequence of database operations grouped together for execution as a logic unit in a DBMS.",
      "id": "91"
    },
    {
      "name": "Logging",
      "description": "Logging is a technique for recovery (assuring atomicity and durability of transactions).",
      "id": "97"
    },
    {
      "name": "ACID Properties",
      "description": "DBMSs ensure the following properties of transactions. Atomicity is the execution of each transaction is atomic, i.e., either all operations are completed or not done at all. Consistency is the states of a database that are consistent (w.r.t. defined business rules) before and after each transaction. Isolation is execution results of each transaction should be unaffected by other concurrently executing transactions. Durability is once a transaction has been successfully completed, its effects should persist in the database",
      "id": "92"
    },
    {
      "name": "The Dirty Read Problem",
      "description": "Dirty read is a read of uncommitted data. If a particular row is modified by another running application and not yet committed, we also run an application to read the same row with the same uncommitted data.",
      "id": "98"
    },
    {
      "name": "Superclass",
      "description": "This type of relationship between subclass and superclass is often described as an ISA relationship type.",
      "id": "55"
    },
    {
      "name": "Database Security",
      "description": "Database security refers to the collective measures used to protect and secure a database or database management software from illegitimate use and malicious cyber threats and attacks.",
      "id": "80"
    },
    {
      "name": "SQL Injection",
      "description": "SQL injection attacks from internal and external users",
      "id": "85"
    },
    {
      "name": "Data integrity",
      "description": "Data integrity refers to the accuracy and consistency of data stored in a database or a data warehouse. Data with “integrity” is said to have a complete structure, i.e. all characteristics defining the data must be correct.",
      "id": "50"
    },
    {
      "name": "Role-Based Access Control (RBAC)",
      "description": "Access rights are grouped by roles, and the use of resources is restricted to individuals assigned to specific roles.\n",
      "id": "88"
    },
    {
      "name": "Serializable",
      "description": "Serializable is the highest solution level. All transactions are totally isolated from other transactions. It is safe but may cause significant performance hit.",
      "id": "103"
    },
    {
      "name": "Foreign key",
      "description": "A foreign key is a column or group of columns in a relational database table that provides a link between data in two tables.",
      "id": "19"
    },
    {
      "name": "SQL",
      "description": "SQL stands for Structured Query Language.  It is used for storing and managing data in a relational database management system (RDMS).",
      "id": "21"
    },
    {
      "name": "Candidate key",
      "description": "A candidate key is a combination of attributes that can be uniquely used to identify a database record without referring to any other data.",
      "id": "27"
    },
    {
      "name": "DML",
      "description": "A data manipulation language (DML) is a computer programming language used for adding (inserting), deleting, and modifying (updating) data in a database. A DML is often a sublanguage of a broader database language such as SQL, with the DML comprising some of the operators in the language.",
      "id": "28"
    },
    {
      "name": "Primary Key",
      "description": "A primary key is a special relational database table column (or combination of columns) designated to uniquely identify all table records.",
      "id": "34"
    },
    {
      "name": "Data type",
      "description": "Data Types define the type of value that can be stored in a table column.",
      "id": "23"
    },
    {
      "name": "SELECT DISTINCT",
      "description": "The SELECT DISTINCT statement is used to return only distinct (different) values. Inside a table, a column often contains many duplicate values; and sometimes you only want to list the different (distinct) values.",
      "id": "35"
    },
    {
      "name": "SELECT",
      "description": "SQL provides the SELECT statement for retrieving data from a database",
      "id": "29"
    },
    {
      "name": "INSERT",
      "description": "The INSERT statement is used to add tuples into a relation.",
      "id": "30"
    },
    {
      "name": "DELETE",
      "description": "The DELETE statement is used to remove tuples from a relation.",
      "id": "31"
    },
    {
      "name": "Read Uncommitted",
      "description": "Read Uncommitted is the least restrictive isolation level.",
      "id": "101"
    },
    {
      "name": "Key attributes",
      "description": "A key attribute is the unique characteristic of the entity.",
      "id": "52"
    },
    {
      "name": "Projection",
      "description": "choose certain attributes (i.e., columns).",
      "id": "77"
    },
    {
      "name": "Relational Algebra",
      "description": "Relational algebra (RA) provides an intermediate step for evaluating SQL.",
      "id": "76"
    },
    {
      "name": "Entity-Relationship Model",
      "description": "An Entity–relationship model (ER model) describes the structure of a database with the help of a diagram, which is known as Entity Relationship Diagram (ER Diagram). An ER model is a design or blueprint of a database that can later be implemented as a database. ",
      "id": "45"
    },
    {
      "name": "weak entity ",
      "description": "A weak entity type is an entity type that does not have sufficient attributes\nto form a primary key.",
      "id": "51"
    },
    {
      "name": "Mandatory Access Control (MAC)",
      "description": "Restrict access to objects based on the sensitivity of the information contained in the objects and the formal authorization of subjects to access information of such sensitivity.",
      "id": "84"
    },
    {
      "name": "Subset",
      "description": "If A and B are two sets, and every element of set A is also an element of set B, then A is called a subset of B",
      "id": "12"
    },
    {
      "name": "Set",
      "description": "In mathematics, a set is nothing more than a collection of objects. Similarly, in databases, records within a table can be treated as objects in a set - i.e. the table becomes a set of records. The SET operator allows the tables of a database to be treated as objects in a set when performing a query.",
      "id": "4"
    },
    {
      "name": "Trojan Horse attacks",
      "description": "Trojan Horse attacks: If Steve tricks Bob into copying data from table R into table R0, then the access control on table R doesn’t apply to the copy of the data in table R0.",
      "id": "90"
    },
    {
      "name": "Discretionary access control (DAC)",
      "description": "Based on the concept of access privileges for giving users such privileges. SQL support DAC; most commercial DBMSs also support DAC.",
      "id": "82"
    },
    {
      "name": "The Lost Update Problem",
      "description": "In the lost update problem, an update done to a data item by a transaction is lost as it is overwritten by the update done by another transaction. ",
      "id": "100"
    },
    {
      "name": "Normalisation",
      "description": "A common approach starts with a universal relation and applies decomposition to create new relations that satisfy certain normal forms (i.e. normalization).",
      "id": "71"
    },
    {
      "name": "Lossless Join",
      "description": "To disallow the possibility of generating spurious tuples when a NATURAL JOIN operation is applied to the relations after decomposition.",
      "id": "72"
    },
    {
      "name": "Dependency preservation",
      "description": "To ensure that each functional dependency can be inferred from functional dependencies after decomposition.",
      "id": "73"
    },
    {
      "name": "Boyce-Codd normal form (BCNF)",
      "description": "Boyce-Codd Normal Form (BCNF) is one of the forms of database normalization. A database table is in BCNF if and only if there are no non-trivial functional dependencies of attributes on anything other than a superset of a candidate key.",
      "id": "74"
    },
    {
      "name": "Third normal form (3NF)",
      "description": "The third normal form — or 3NF — is part of a set of concepts for database normalization that also includes first normal form (1NF) and second normal form (2NF).",
      "id": "75"
    },
    {
      "name": "EXISTS",
      "description": "The EXISTS condition in SQL is used to check whether the result of a correlated nested query is empty (contains no tuples) or not. The result of EXISTS is a boolean value True or False. It can be used in a SELECT, UPDATE, INSERT or DELETE statement.",
      "id": "44"
    },
    {
      "name": "Attribute",
      "description": "Attributes are used to describe the properties of information. In the relational model, they usually refer to atomic data.",
      "id": "16"
    },
    {
      "name": "Prime Attribute",
      "description": "A prime attribute is an attribute occurring in a candidate key",
      "id": "70"
    },
    {
      "name": "Participation constraints",
      "description": "Specifies whether the existence of any entity depends on its being related to another entity via the relationship type.",
      "id": "58"
    },
    {
      "name": "Total ",
      "description": "It specifies that each entity present in the entity set must mandatorily participate in at least one relationship instance of that relationship set,for this reason, it is also called as mandatory participation",
      "id": "49"
    },
    {
      "name": "GRANT",
      "description": "GRANT gives privileges to users.",
      "id": "83"
    },
    {
      "name": "GROUP BY",
      "description": "GROUP BY attribute list groups tuples for each value combination in the attribute list.",
      "id": "36"
    },
    {
      "name": "COUNT",
      "description": "COUNT returns the total number of argument values",
      "id": "37"
    },
    {
      "name": "MIN",
      "description": "MIN returns the minimum value of the arguments",
      "id": "38"
    },
    {
      "name": "HAVING",
      "description": "We can use HAVING condition to add the condition on the groups.",
      "id": "39"
    },
    {
      "name": "Relationship",
      "description": "Relationship types are represented as diamonds.",
      "id": "47"
    },
    {
      "name": "partial",
      "description": "It specifies that each entity in the entity set may or may not participate in the relationship instance in that relationship set.",
      "id": "63"
    },
    {
      "name": "REVOKE",
      "description": "REVOKE takes away privileges from users.",
      "id": "86"
    },
    {
      "name": "Specifying Privileges - Views",
      "description": "Views provide an important mechanism for discretionary authorization.",
      "id": "87"
    },
    {
      "name": "Inner Join",
      "description": "Inner Join is tuples are included in the result only if there is at least one matching in both relations.",
      "id": "41"
    },
    {
      "name": "One-To-Many",
      "description": "A one-to-many relationship is where one occurrence in an entity relates to many occurrences in another entity.",
      "id": "60"
    },
    {
      "name": "Closure",
      "description": "The set of all those attributes which can be functionally determined from an attribute set is called as the closure of that attribute set.\n",
      "id": "66"
    },
    {
      "name": "CREATE TABLE",
      "description": "The CREATE TABLE statement is used to create a new relation schema by specifying its name, its attributes and, optionally, its constraints.",
      "id": "24"
    },
    {
      "name": "Data structure",
      "description": "The data structure is a data organization, management, and storage format that enables efficient access and modification. More precisely, a data structure is a collection of data values, the relationships among them, and the functions or operations that can be applied to the data.",
      "id": "46"
    },
    {
      "name": "DROP TABLE",
      "description": "The DROP TABLE statement is used to remove an existing relation schema from a database schema.",
      "id": "25"
    },
    {
      "name": "Left Join",
      "description": "A left join retains all rows of the left table regardless of whether there is a row that matches on the right table.",
      "id": "43"
    },
    {
      "name": "Trivial",
      "description": "A FD is trivial if it can always be satisfied",
      "id": "65"
    },
    {
      "name": "Renaming",
      "description": "Renaming is used to rename either the relation name or the attribute names, or both.",
      "id": "79"
    },
    {
      "name": "Superkey",
      "description": "A superkey SK of R is a subset of attributes of R.",
      "id": "18"
    },
    {
      "name": "One-To-One",
      "description": "One-to-one is where one occurrence of an entity relates to only one occurrence in another entity, eg if a man only marries one woman and a woman only marries one man, it is a one-to-one (1:1) relationship.",
      "id": "61"
    },
    {
      "name": "Selection",
      "description": "Select operation chooses the subset of tuples from the relation that satisfies the given condition mentioned in the syntax of selection. The selection operation is also known as horizontal partitioning since it partitions the table or relation horizontally.\n",
      "id": "78"
    },
    {
      "name": "Cartesian product",
      "description": "The Cartesian product operation takes an ordered list of sets and returns a set of tuples.",
      "id": "6"
    },
    {
      "name": "Cardinality",
      "description": "the cardinality of a set is a measure of the number of elements of the set.",
      "id": "7"
    },
    {
      "name": "Equality",
      "description": "Set equality is the term that is used to indicate that two sets are equal.",
      "id": "8"
    },
    {
      "name": "union",
      "description": "The union of two sets is a set containing all elements that are in A or in B (possibly both).",
      "id": "9"
    },
    {
      "name": "Intersection",
      "description": "The intersection of two given sets is the set that contains all the elements that are common to both sets.",
      "id": "10"
    },
    {
      "name": "Difference",
      "description": "The difference of two sets A and B is defined as the lists of all the elements that are in set A but that are not present in set B.",
      "id": "11"
    },
    {
      "name": "Tuple",
      "description": "A tuple is an ordered list of n elements.",
      "id": "13"
    },
    {
      "name": "Relation",
      "description": "A relation is a subset of a Cartesian product of sets.",
      "id": "17"
    }
  ],
  "links": [
    {
      "source": "54",
      "target": "53"
    },
    {
      "source": "53",
      "target": "56"
    },
    {
      "source": "53",
      "target": "48"
    },
    {
      "source": "56",
      "target": "50"
    },
    {
      "source": "59",
      "target": "57"
    },
    {
      "source": "57",
      "target": "60"
    },
    {
      "source": "57",
      "target": "47"
    },
    {
      "source": "96",
      "target": "94"
    },
    {
      "source": "94",
      "target": "93"
    },
    {
      "source": "15",
      "target": "14"
    },
    {
      "source": "26",
      "target": "22"
    },
    {
      "source": "89",
      "target": "81"
    },
    {
      "source": "81",
      "target": "86"
    },
    {
      "source": "81",
      "target": "87"
    },
    {
      "source": "20",
      "target": "14"
    },
    {
      "source": "40",
      "target": "32"
    },
    {
      "source": "64",
      "target": "67"
    },
    {
      "source": "64",
      "target": "68"
    },
    {
      "source": "64",
      "target": "69"
    },
    {
      "source": "64",
      "target": "14"
    },
    {
      "source": "99",
      "target": "95"
    },
    {
      "source": "42",
      "target": "33"
    },
    {
      "source": "33",
      "target": "32"
    },
    {
      "source": "33",
      "target": "41"
    },
    {
      "source": "102",
      "target": "93"
    },
    {
      "source": "93",
      "target": "92"
    },
    {
      "source": "93",
      "target": "101"
    },
    {
      "source": "91",
      "target": "97"
    },
    {
      "source": "91",
      "target": "92"
    },
    {
      "source": "91",
      "target": "94"
    },
    {
      "source": "91",
      "target": "95"
    },
    {
      "source": "98",
      "target": "95"
    },
    {
      "source": "55",
      "target": "53"
    },
    {
      "source": "80",
      "target": "89"
    },
    {
      "source": "80",
      "target": "81"
    },
    {
      "source": "80",
      "target": "85"
    },
    {
      "source": "50",
      "target": "57"
    },
    {
      "source": "88",
      "target": "80"
    },
    {
      "source": "88",
      "target": "81"
    },
    {
      "source": "103",
      "target": "93"
    },
    {
      "source": "19",
      "target": "14"
    },
    {
      "source": "21",
      "target": "32"
    },
    {
      "source": "21",
      "target": "28"
    },
    {
      "source": "21",
      "target": "22"
    },
    {
      "source": "21",
      "target": "23"
    },
    {
      "source": "27",
      "target": "14"
    },
    {
      "source": "28",
      "target": "35"
    },
    {
      "source": "28",
      "target": "29"
    },
    {
      "source": "28",
      "target": "30"
    },
    {
      "source": "28",
      "target": "31"
    },
    {
      "source": "34",
      "target": "14"
    },
    {
      "source": "52",
      "target": "19"
    },
    {
      "source": "52",
      "target": "34"
    },
    {
      "source": "52",
      "target": "27"
    },
    {
      "source": "77",
      "target": "76"
    },
    {
      "source": "45",
      "target": "56"
    },
    {
      "source": "45",
      "target": "48"
    },
    {
      "source": "45",
      "target": "51"
    },
    {
      "source": "45",
      "target": "53"
    },
    {
      "source": "84",
      "target": "81"
    },
    {
      "source": "12",
      "target": "4"
    },
    {
      "source": "4",
      "target": "6"
    },
    {
      "source": "4",
      "target": "7"
    },
    {
      "source": "4",
      "target": "8"
    },
    {
      "source": "4",
      "target": "9"
    },
    {
      "source": "4",
      "target": "10"
    },
    {
      "source": "4",
      "target": "11"
    },
    {
      "source": "4",
      "target": "13"
    },
    {
      "source": "4",
      "target": "17"
    },
    {
      "source": "90",
      "target": "82"
    },
    {
      "source": "82",
      "target": "81"
    },
    {
      "source": "82",
      "target": "86"
    },
    {
      "source": "82",
      "target": "87"
    },
    {
      "source": "100",
      "target": "95"
    },
    {
      "source": "71",
      "target": "72"
    },
    {
      "source": "71",
      "target": "73"
    },
    {
      "source": "71",
      "target": "74"
    },
    {
      "source": "71",
      "target": "75"
    },
    {
      "source": "44",
      "target": "32"
    },
    {
      "source": "16",
      "target": "70"
    },
    {
      "source": "16",
      "target": "14"
    },
    {
      "source": "58",
      "target": "49"
    },
    {
      "source": "58",
      "target": "50"
    },
    {
      "source": "58",
      "target": "47"
    },
    {
      "source": "58",
      "target": "63"
    },
    {
      "source": "83",
      "target": "82"
    },
    {
      "source": "36",
      "target": "32"
    },
    {
      "source": "36",
      "target": "37"
    },
    {
      "source": "36",
      "target": "38"
    },
    {
      "source": "36",
      "target": "39"
    },
    {
      "source": "66",
      "target": "16"
    },
    {
      "source": "24",
      "target": "22"
    },
    {
      "source": "46",
      "target": "56"
    },
    {
      "source": "25",
      "target": "22"
    },
    {
      "source": "43",
      "target": "33"
    },
    {
      "source": "65",
      "target": "64"
    },
    {
      "source": "79",
      "target": "76"
    },
    {
      "source": "18",
      "target": "52"
    },
    {
      "source": "18",
      "target": "14"
    },
    {
      "source": "61",
      "target": "57"
    },
    {
      "source": "78",
      "target": "76"
    }
  ]
}